15-minute-intro.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Tamara Temple)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<meta name="description" content="lightning talk on storybook for react">
</head>
<body>
<div class="reveal">
<div class="slides">
<style media="screen">
@import url("//fonts.googleapis.com/css?family=Montserrat:700,700i");
.reveal h1,.reveal h2,.reveal h3,.reveal h4,.reveal h5,.reveal h6 {
text-transform: inherit; font-family: "Montserrat", sans-serif; font-weight: bold;
}

@import url("//fonts.googleapis.com/css?family=Lato:400,400i");
.reveal section. .reveal div, .reveal p, .reveal ul, .reveal ol, .reveal li, .reveal dl, .reveal dt, .reveal dd,
.reveal blockquote, .reveal q, .reveal aside, .reveal figure, .reveal figcaption, .reveal article, .reveal header,
.reveal footer, .reveal span, .reveal i, .reveal b, .reveal em, .reveal strong {
font-family: "Lato", sans-serif;
}
.reveal .slide-number { color: white; }
</style>

<section>
<section id="slide-orgdc77a8f">
<h2 id="orgdc77a8f">STORYBOOK DEMO</h2>
<p>
15-minute Demo / Lightning talk
</p>

</section>
</section>
<section>
<section id="slide-org5d9d9ae">
<h2 id="org5d9d9ae">Background</h2>
<ul>
<li>11 year old Ruby on Rails project</li>
<li>React components started being added about 4 years ago</li>
<li>Standalone react web client started a couple years ago</li>
<li>Began working on the standalone client + graphql interface about a little over a year ago</li>

</ul>

</section>
</section>
<section>
<section id="slide-org9f39191">
<h2 id="org9f39191">What was the problem?</h2>
<ul>
<li>Learning React, I wasn't sure how things would look and work</li>
<li>Just writing unit tests was not enough to know if I'd implemented the component correctly</li>
<li>Build and interact with components without needing the entire app behind it</li>
<li>Top-down design, Bottom-up implementation (very Lisp-like for me)</li>

</ul>

</section>
</section>
<section>
<section id="slide-org5131caf">
<h2 id="org5131caf">What is Storybook?</h2>
<p>
An environment to house components for display, interaction, and demostration
</p>

<p>
<a href="https://storybook.js.org/">https://storybook.js.org/</a>
</p>

</section>
</section>
<section>
<section id="slide-org4717c87">
<h2 id="org4717c87">Demo</h2>
<p>
<code>cd demo</code>
</p>

<p>
Start demo: <code>yarn storybook</code>
</p>

<p>
<a href="http://localhost:9009">http://localhost:9009</a>
</p>

</section>
</section>
<section>
<section id="slide-org983564a">
<h2 id="org983564a">Config</h2>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #00ffff;">import</span> { configure } from <span style="color: #ffff00;">'@storybook/react'</span>;

<span style="color: #00ffff;">function</span> <span style="color: #4186be;">loadStories</span>() {
  require(<span style="color: #ffff00;">'../src/stories'</span>);
}

configure(loadStories, module);
</pre>
</div>

<p>
<b><a href="https://storybook.js.org/basics/guide-react/#create-the-config-file">reference</a></b>
</p>

</section>
</section>
<section>
<section id="slide-orgd8b18d3">
<h2 id="orgd8b18d3">Writing Stories</h2>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #00ffff;">import</span> React from <span style="color: #ffff00;">"react"</span>
<span style="color: #00ffff;">import</span> { storiesOf } from <span style="color: #ffff00;">"@storybook/react"</span>
<span style="color: #00ffff;">import</span> { action } from <span style="color: #ffff00;">"@storybook/addon-actions"</span>

<span style="color: #ff0000;">// </span><span style="color: #ff0000;">Import our Component Under Test</span>
<span style="color: #00ffff;">import</span> { ButtOn } from <span style="color: #ffff00;">"../components/ButtOn"</span>

<span style="color: #ff0000;">// </span><span style="color: #ff0000;">Create Stories</span>
storiesOf(<span style="color: #ffff00;">"ButtOn"</span>, module)
  <span style="color: #ff0000;">// </span><span style="color: #ff0000;">Story Scenario One</span>
  .add(<span style="color: #ffff00;">"click me!"</span>, () =&gt; (
    &lt;ButtOn onClick={action(<span style="color: #ffff00;">"Click Me! was clicked"</span>)}&gt;Click Me!&lt;/ButtOn&gt;
  ))
  <span style="color: #ff0000;">// </span><span style="color: #ff0000;">Story Scenario Two</span>
  .add(<span style="color: #ffff00;">"click 2"</span>, () =&gt; (
    &lt;ButtOn onClick={action(<span style="color: #ffff00;">"Clicker2 was clicked"</span>)}&gt;Clicker2&lt;/ButtOn&gt;
  ))
</pre>
</div>

<p>
<b><a href="https://storybook.js.org/basics/guide-react/#write-your-stories">reference</a></b>
</p>
</section>
</section>
</div>
</div>
<div> Created by Tamara Temple &lt;tamara@tamouse.org&gt; </div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: true,
center: true,
slideNumber: 'c',
rollingLinks: true,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'none', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
